{
  "experience": [
    {
      "company": "Stiegler EdTech",
      "role": "Co-founder & Chief Technology Officer",
      "period": "Aug 2023 - Present",
      "description": "Design and implement technical vision and strategy for the company, aligning engineering efforts with long-term business goals. Lead the design, architecture, and deployment of scalable edtech platforms, driving innovation in educational products and experiences. Manage cross-functional teams, mentoring developers and fostering a culture of continuous improvement and ownership. Oversee product development lifecycles—from ideation to launch—ensuring delivery of high-quality software solutions on schedule. Collaborate closely with product, operations, and STEM teams to align technology with internal goals and learner outcomes. Evaluate and implement tools, frameworks, and emerging tech (e.g. AI, real-time collaboration) to enhance platform capabilities. Represent the company in investor meetings, technical partnerships, and strategic discussions.",
      "technologies": [
        "Technical Strategy",
        "Full-Stack Development",
        "Software Architecture",
        "Leadership",
        "Mentoring",
        "Product Development",
        "Artificial Intelligence (AI)",
        "Next.js",
        "TypeScript"
      ]
    },
    {
      "company": "Stiegler EdTech",
      "role": "Co-founder & Director Of Curriculum / Programming",
      "period": "Mar 2022 - Aug 2023",
      "description": "Led diverse teams including TAs, admins, students, and a DevOps team, focusing on workload distribution, skill development, and timely project delivery. Conducted daily lectures on various technical topics, offering personalized student assessments and fostering professional development. Innovated and created technical learning materials, assignments, and projects, constantly adapting to industry demands and continuous improvement. Collaborated with external stakeholders such as hiring companies, alums, and industry professionals to meet hiring needs, enhance engagement, and address ad hoc requests. Developed and oversaw internal HR procedures, such as onboarding, hiring, recruiting, and benefits management, for organizational efficiency and employee development.",
      "technologies": [
        "Coaching",
        "React.js",
        "Teaching",
        "JavaScript",
        "Databases",
        "Java",
        "Employee Training",
        "Tailwind CSS",
        "Relational Databases",
        "Microsoft Office",
        "SQL",
        "Teamwork",
        "MySQL",
        "HTML",
        "SASS",
        "TypeScript",
        "Object-Oriented Programming (OOP)",
        "Cascading Style Sheets (CSS)",
        "Jest",
        "Spring Boot",
        "Problem Solving",
        "Git",
        "Public Speaking",
        "User Experience (UX)",
        "Microsoft Word",
        "Software Development Life Cycle (SDLC)",
        "PowerPoint",
        "Leadership",
        "Time Management",
        "Node.js",
        "GitHub"
      ]
    },
    {
      "company": "Ally",
      "role": "Frontend Web Developer",
      "period": "Aug 2020 - Mar 2022",
      "description": "Regularly contributed code changes, updates, and net new content to ally.com. Identified and resolved bugs in critical areas within site to increase system performance and security. Oversaw several legacy code bases being the sole contributor and maintainer to regularly used site. Actively prioritized vulnerabilities or key features to site owners for top levels of security and user experience. Continuously trained, attended webinars and improved on technical skills required for development.",
      "technologies": [
        "JavaScript",
        "Java",
        "Microsoft Office",
        "Teamwork",
        "HTML",
        "SASS",
        "TypeScript",
        "Object-Oriented Programming (OOP)",
        "Cascading Style Sheets (CSS)",
        "Agile Methodologies",
        "Jest",
        "Problem Solving",
        "Git",
        "User Experience (UX)",
        "Microsoft Word",
        "Software Development Life Cycle (SDLC)",
        "PowerPoint",
        "Leadership",
        "Time Management",
        "Node.js"
      ]
    },
    {
      "company": "Carolina Fintech Hub",
      "role": "WIN Program Participant",
      "period": "Mar 2020 - Aug 2020",
      "description": "Trained to build and maintain enterprise applications for Fintech partners on a 50 member team. Designed, built, and deployed full-stack web applications using JavaScript, Java, Springboot, and other modern technologies. Involved in all phases of Software Development Life Cycle (SDLC). Participated in Agile meetings to determine progress and prioritize Product Backlog.",
      "technologies": [
        "React.js",
        "JavaScript",
        "Databases",
        "Java",
        "Relational Databases",
        "Microsoft Office",
        "SQL",
        "Teamwork",
        "MySQL",
        "HTML",
        "SASS",
        "TypeScript",
        "Object-Oriented Programming (OOP)",
        "Cascading Style Sheets (CSS)",
        "Agile Methodologies",
        "Spring Boot",
        "Problem Solving",
        "Git",
        "User Experience (UX)",
        "Microsoft Word",
        "Software Development Life Cycle (SDLC)",
        "PowerPoint",
        "Leadership",
        "Time Management",
        "Node.js",
        "GitHub"
      ]
    },
    {
      "company": "Wells Fargo",
      "role": "Business Risk & Control Analyst",
      "period": "Aug 2019 - Mar 2020",
      "description": "Analyzed business processes and controls to identify and mitigate risks. Developed and maintained risk assessment frameworks and documentation. Collaborated with cross-functional teams to ensure compliance with regulatory requirements.",
      "technologies": ["Communication", "Microsoft Office"]
    },
    {
      "company": "Wells Fargo",
      "role": "Early Talent Program Associate",
      "period": "Aug 2018 - Jul 2019",
      "description": "Competitive program rotating to different departments within the bank every 6 months. Developed a project management dashboard using Tableau for managing efforts for a large team. Visualized analytics using Excel and VBA for presenting metrics to senior leadership. Investigated and mapped complex business processes to be utilized as a resource for the team. Composed several policies and procedures to assist the team in achieving audit requirements. Engaged in dozens of training and seminars to develop leadership and professionalism.",
      "technologies": [
        "Communication",
        "Microsoft Office",
        "Microsoft Excel",
        "Teamwork",
        "Business Analytics",
        "Tableau",
        "Problem Solving",
        "Data Analysis",
        "Microsoft Word",
        "PowerPoint",
        "Leadership",
        "Time Management"
      ]
    }
  ]
}
